#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
random_id.bucket_id: Refreshing state... [id=1NQhVYR7gkQ]
data.google_client_config.provider: Reading...
module.stg_apps.google_compute_global_address.static_ip: Refreshing state... [id=projects/hackathon-climat-05/global/addresses/greenmile-front-stg]
module.prod_apps.google_compute_global_address.static_ip: Refreshing state... [id=projects/hackathon-climat-05/global/addresses/greenmile-front-prod]
google_storage_bucket.tf_state_bucket: Refreshing state... [id=terraform-state-d4d42155847b8244]
google_container_cluster.prod_cluster: Refreshing state... [id=projects/hackathon-climat-05/locations/europe-west1/clusters/prod-cluster]
data.google_client_config.provider: Read complete after 0s [id=projects/hackathon-climat-05/regions//zones/]
module.stg_apps.kubernetes_deployment.auth_microservice: Refreshing state... [id=greenmile-stg/auth-microservice]
module.prod_apps.kubernetes_deployment.auth_microservice: Refreshing state... [id=greenmile-prod/auth-microservice]
module.stg_apps.kubernetes_namespace.namespace: Refreshing state... [id=greenmile-stg]
module.stg_apps.kubernetes_service.auth: Refreshing state... [id=greenmile-stg/auth]
module.prod_apps.kubernetes_namespace.namespace: Refreshing state... [id=greenmile-prod]
module.stg_apps.kubernetes_horizontal_pod_autoscaler.auth_autoscaler: Refreshing state... [id=greenmile-stg/auth-autoscaler]
module.prod_apps.kubernetes_service.auth: Refreshing state... [id=greenmile-prod/auth]
module.prod_apps.kubernetes_horizontal_pod_autoscaler.auth_autoscaler: Refreshing state... [id=greenmile-prod/auth-autoscaler]
module.prod_apps.kubernetes_deployment.app_front: Refreshing state... [id=greenmile-prod/app-front]
module.stg_apps.kubernetes_deployment.app_front: Refreshing state... [id=greenmile-stg/app-front]
module.prod_apps.kubernetes_service.front: Refreshing state... [id=greenmile-prod/front]
module.prod_apps.kubernetes_horizontal_pod_autoscaler.front_autoscaler: Refreshing state... [id=greenmile-prod/front-autoscaler]
module.stg_apps.kubernetes_service.front: Refreshing state... [id=greenmile-stg/front]
module.stg_apps.kubernetes_horizontal_pod_autoscaler.front_autoscaler: Refreshing state... [id=greenmile-stg/front-autoscaler]
module.prod_apps.kubernetes_manifest.app_ssl_certificate: Refreshing state...
module.stg_apps.kubernetes_manifest.app_ssl_certificate: Refreshing state...
module.prod_apps.kubernetes_ingress_v1.app_ingress: Refreshing state... [id=greenmile-prod/app-ingress]
module.stg_apps.kubernetes_ingress_v1.app_ingress: Refreshing state... [id=greenmile-stg/app-ingress]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.prod_apps.kubernetes_deployment.auth_microservice will be destroyed
  # (because kubernetes_deployment.auth_microservice is not in configuration)
  - resource "kubernetes_deployment" "auth_microservice" {
      - id               = "greenmile-prod/auth-microservice" -> null
      - wait_for_rollout = true -> null

      - metadata {
          - annotations      = {
              - "autopilot.gke.io/resource-adjustment" = jsonencode(
                    {
                      - input    = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu    = "1"
                                      - memory = "512Mi"
                                    }
                                  - name     = "auth-microservice"
                                  - requests = {
                                      - cpu    = "250m"
                                      - memory = "50Mi"
                                    }
                                },
                            ]
                        }
                      - modified = true
                      - output   = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                  - name     = "auth-microservice"
                                  - requests = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                },
                            ]
                        }
                    }
                )
            } -> null
          - generation       = 2 -> null
          - labels           = {
              - "app"          = "greenmile"
              - "env"          = "prod"
              - "microservice" = "auth"
              - "side"         = "backend"
            } -> null
          - name             = "auth-microservice" -> null
          - namespace        = "greenmile-prod" -> null
          - resource_version = "1190050" -> null
          - uid              = "1a49f28b-f707-497d-99d6-3be42685c04b" -> null
        }

      - spec {
          - min_ready_seconds         = 0 -> null
          - paused                    = false -> null
          - progress_deadline_seconds = 600 -> null
          - replicas                  = "2" -> null
          - revision_history_limit    = 10 -> null

          - selector {
              - match_labels = {
                  - "app"          = "greenmile"
                  - "env"          = "prod"
                  - "microservice" = "auth"
                  - "side"         = "backend"
                } -> null
            }

          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          - template {
              - metadata {
                  - annotations = {} -> null
                  - generation  = 0 -> null
                  - labels      = {
                      - "app"          = "greenmile"
                      - "env"          = "prod"
                      - "microservice" = "auth"
                      - "side"         = "backend"
                    } -> null
                }

              - spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = true -> null
                  - dns_policy                       = "ClusterFirst" -> null
                  - enable_service_links             = true -> null
                  - host_ipc                         = false -> null
                  - host_network                     = false -> null
                  - host_pid                         = false -> null
                  - node_selector                    = {} -> null
                  - restart_policy                   = "Always" -> null
                  - share_process_namespace          = false -> null
                  - termination_grace_period_seconds = 30 -> null

                  - container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      - image                      = "ghcr.io/hackathon-climat-05/auth-microservice:v0.0.1" -> null
                      - image_pull_policy          = "Always" -> null
                      - name                       = "auth-microservice" -> null
                      - stdin                      = false -> null
                      - stdin_once                 = false -> null
                      - termination_message_path   = "/dev/termination-log" -> null
                      - termination_message_policy = "File" -> null
                      - tty                        = false -> null

                      - liveness_probe {
                          - failure_threshold     = 3 -> null
                          - initial_delay_seconds = 1 -> null
                          - period_seconds        = 1 -> null
                          - success_threshold     = 1 -> null
                          - timeout_seconds       = 1 -> null

                          - http_get {
                              - path   = "/livez" -> null
                              - port   = "8080" -> null
                              - scheme = "HTTP" -> null
                            }
                        }

                      - port {
                          - container_port = 8080 -> null
                          - host_port      = 0 -> null
                          - name           = "http" -> null
                          - protocol       = "TCP" -> null
                        }

                      - resources {
                          - limits   = {
                              - "cpu"               = "250m"
                              - "ephemeral-storage" = "1Gi"
                              - "memory"            = "512Mi"
                            } -> null
                          - requests = {
                              - "cpu"               = "250m"
                              - "ephemeral-storage" = "1Gi"
                              - "memory"            = "512Mi"
                            } -> null
                        }

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }
                    }

                  - security_context {
                      - run_as_non_root     = false -> null
                      - supplemental_groups = [] -> null

                      - seccomp_profile {
                          - type = "RuntimeDefault" -> null
                        }
                    }
                }
            }
        }
    }

  # module.prod_apps.kubernetes_horizontal_pod_autoscaler.auth_autoscaler will be destroyed
  # (because kubernetes_horizontal_pod_autoscaler.auth_autoscaler is not in configuration)
  - resource "kubernetes_horizontal_pod_autoscaler" "auth_autoscaler" {
      - id = "greenmile-prod/auth-autoscaler" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "auth-autoscaler" -> null
          - namespace        = "greenmile-prod" -> null
          - resource_version = "1175861" -> null
          - uid              = "a534b1f0-fd50-4430-a7ac-a7a44d63b216" -> null
        }

      - spec {
          - max_replicas                      = 10 -> null
          - min_replicas                      = 2 -> null
          - target_cpu_utilization_percentage = 0 -> null

          - behavior {
              - scale_down {
                  - select_policy                = "Max" -> null
                  - stabilization_window_seconds = 0 -> null

                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Percent" -> null
                      - value          = 100 -> null
                    }
                }

              - scale_up {
                  - select_policy                = "Max" -> null
                  - stabilization_window_seconds = 0 -> null

                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Pods" -> null
                      - value          = 4 -> null
                    }
                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Percent" -> null
                      - value          = 100 -> null
                    }
                }
            }

          - metric {
              - type = "Resource" -> null

              - resource {
                  - name = "cpu" -> null

                  - target {
                      - average_utilization = 50 -> null
                      - type                = "Utilization" -> null
                    }
                }
            }

          - scale_target_ref {
              - kind = "Deployment" -> null
              - name = "auth-microservice" -> null
            }
        }
    }

  # module.prod_apps.kubernetes_service.auth will be destroyed
  # (because kubernetes_service.auth is not in configuration)
  - resource "kubernetes_service" "auth" {
      - id                     = "greenmile-prod/auth" -> null
      - status                 = [
          - {
              - load_balancer = [
                  - {
                      - ingress = []
                    },
                ]
            },
        ] -> null
      - wait_for_load_balancer = true -> null

      - metadata {
          - annotations      = {
              - "cloud.google.com/neg" = jsonencode(
                    {
                      - ingress = true
                    }
                )
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "auth" -> null
          - namespace        = "greenmile-prod" -> null
          - resource_version = "1175699" -> null
          - uid              = "ce7e24ac-6a10-4b17-85f9-90864593df70" -> null
        }

      - spec {
          - cluster_ip                  = "10.120.0.174" -> null
          - external_ips                = [] -> null
          - health_check_node_port      = 0 -> null
          - ip_families                 = [
              - "IPv4",
            ] -> null
          - ip_family_policy            = "SingleStack" -> null
          - load_balancer_source_ranges = [] -> null
          - publish_not_ready_addresses = false -> null
          - selector                    = {
              - "app"          = "greenmile"
              - "env"          = "prod"
              - "microservice" = "auth"
              - "side"         = "backend"
            } -> null
          - session_affinity            = "ClientIP" -> null
          - type                        = "ClusterIP" -> null

          - port {
              - name        = "http" -> null
              - node_port   = 0 -> null
              - port        = 80 -> null
              - protocol    = "TCP" -> null
              - target_port = "http" -> null
            }
        }
    }

  # module.stg_apps.kubernetes_deployment.app_front will be updated in-place
  ~ resource "kubernetes_deployment" "app_front" {
        id               = "greenmile-stg/app-front"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/hackathon-climat-05/app-front:stg-main-f20cc5a-1656331750" -> "ghcr.io/hackathon-climat-05/app-front:stg-latest"
                        name                       = "app-front"
                        # (8 unchanged attributes hidden)




                        # (4 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.stg_apps.kubernetes_deployment.auth_microservice will be destroyed
  # (because kubernetes_deployment.auth_microservice is not in configuration)
  - resource "kubernetes_deployment" "auth_microservice" {
      - id               = "greenmile-stg/auth-microservice" -> null
      - wait_for_rollout = true -> null

      - metadata {
          - annotations      = {
              - "autopilot.gke.io/resource-adjustment" = jsonencode(
                    {
                      - input    = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu    = "1"
                                      - memory = "512Mi"
                                    }
                                  - name     = "auth-microservice"
                                  - requests = {
                                      - cpu    = "250m"
                                      - memory = "50Mi"
                                    }
                                },
                            ]
                        }
                      - modified = true
                      - output   = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                  - name     = "auth-microservice"
                                  - requests = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                },
                            ]
                        }
                    }
                )
            } -> null
          - generation       = 2 -> null
          - labels           = {
              - "app"          = "greenmile"
              - "env"          = "stg"
              - "microservice" = "auth"
              - "side"         = "backend"
            } -> null
          - name             = "auth-microservice" -> null
          - namespace        = "greenmile-stg" -> null
          - resource_version = "1190138" -> null
          - uid              = "4c984be6-3397-4dae-9f7c-db53769e0086" -> null
        }

      - spec {
          - min_ready_seconds         = 0 -> null
          - paused                    = false -> null
          - progress_deadline_seconds = 600 -> null
          - replicas                  = "2" -> null
          - revision_history_limit    = 10 -> null

          - selector {
              - match_labels = {
                  - "app"          = "greenmile"
                  - "env"          = "stg"
                  - "microservice" = "auth"
                  - "side"         = "backend"
                } -> null
            }

          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          - template {
              - metadata {
                  - annotations = {} -> null
                  - generation  = 0 -> null
                  - labels      = {
                      - "app"          = "greenmile"
                      - "env"          = "stg"
                      - "microservice" = "auth"
                      - "side"         = "backend"
                    } -> null
                }

              - spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = true -> null
                  - dns_policy                       = "ClusterFirst" -> null
                  - enable_service_links             = true -> null
                  - host_ipc                         = false -> null
                  - host_network                     = false -> null
                  - host_pid                         = false -> null
                  - node_selector                    = {} -> null
                  - restart_policy                   = "Always" -> null
                  - share_process_namespace          = false -> null
                  - termination_grace_period_seconds = 30 -> null

                  - container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      - image                      = "ghcr.io/hackathon-climat-05/auth-microservice:stg-main-d499feb-1656247276" -> null
                      - image_pull_policy          = "Always" -> null
                      - name                       = "auth-microservice" -> null
                      - stdin                      = false -> null
                      - stdin_once                 = false -> null
                      - termination_message_path   = "/dev/termination-log" -> null
                      - termination_message_policy = "File" -> null
                      - tty                        = false -> null

                      - liveness_probe {
                          - failure_threshold     = 3 -> null
                          - initial_delay_seconds = 1 -> null
                          - period_seconds        = 1 -> null
                          - success_threshold     = 1 -> null
                          - timeout_seconds       = 1 -> null

                          - http_get {
                              - path   = "/livez" -> null
                              - port   = "8080" -> null
                              - scheme = "HTTP" -> null
                            }
                        }

                      - port {
                          - container_port = 8080 -> null
                          - host_port      = 0 -> null
                          - name           = "http" -> null
                          - protocol       = "TCP" -> null
                        }

                      - resources {
                          - limits   = {
                              - "cpu"               = "250m"
                              - "ephemeral-storage" = "1Gi"
                              - "memory"            = "512Mi"
                            } -> null
                          - requests = {
                              - "cpu"               = "250m"
                              - "ephemeral-storage" = "1Gi"
                              - "memory"            = "512Mi"
                            } -> null
                        }

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }
                    }

                  - security_context {
                      - run_as_non_root     = false -> null
                      - supplemental_groups = [] -> null

                      - seccomp_profile {
                          - type = "RuntimeDefault" -> null
                        }
                    }
                }
            }
        }
    }

  # module.stg_apps.kubernetes_horizontal_pod_autoscaler.auth_autoscaler will be destroyed
  # (because kubernetes_horizontal_pod_autoscaler.auth_autoscaler is not in configuration)
  - resource "kubernetes_horizontal_pod_autoscaler" "auth_autoscaler" {
      - id = "greenmile-stg/auth-autoscaler" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "auth-autoscaler" -> null
          - namespace        = "greenmile-stg" -> null
          - resource_version = "1175862" -> null
          - uid              = "7fe581fa-edd7-4d4d-88a4-62c5c21fd521" -> null
        }

      - spec {
          - max_replicas                      = 5 -> null
          - min_replicas                      = 2 -> null
          - target_cpu_utilization_percentage = 0 -> null

          - behavior {
              - scale_down {
                  - select_policy                = "Max" -> null
                  - stabilization_window_seconds = 0 -> null

                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Percent" -> null
                      - value          = 100 -> null
                    }
                }

              - scale_up {
                  - select_policy                = "Max" -> null
                  - stabilization_window_seconds = 0 -> null

                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Pods" -> null
                      - value          = 4 -> null
                    }
                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Percent" -> null
                      - value          = 100 -> null
                    }
                }
            }

          - metric {
              - type = "Resource" -> null

              - resource {
                  - name = "cpu" -> null

                  - target {
                      - average_utilization = 50 -> null
                      - type                = "Utilization" -> null
                    }
                }
            }

          - scale_target_ref {
              - kind = "Deployment" -> null
              - name = "auth-microservice" -> null
            }
        }
    }

  # module.stg_apps.kubernetes_service.auth will be destroyed
  # (because kubernetes_service.auth is not in configuration)
  - resource "kubernetes_service" "auth" {
      - id                     = "greenmile-stg/auth" -> null
      - status                 = [
          - {
              - load_balancer = [
                  - {
                      - ingress = []
                    },
                ]
            },
        ] -> null
      - wait_for_load_balancer = true -> null

      - metadata {
          - annotations      = {
              - "cloud.google.com/neg" = jsonencode(
                    {
                      - ingress = true
                    }
                )
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "auth" -> null
          - namespace        = "greenmile-stg" -> null
          - resource_version = "1175689" -> null
          - uid              = "1b22793b-81bf-4423-bb93-3077a9d52654" -> null
        }

      - spec {
          - cluster_ip                  = "10.120.0.27" -> null
          - external_ips                = [] -> null
          - health_check_node_port      = 0 -> null
          - ip_families                 = [
              - "IPv4",
            ] -> null
          - ip_family_policy            = "SingleStack" -> null
          - load_balancer_source_ranges = [] -> null
          - publish_not_ready_addresses = false -> null
          - selector                    = {
              - "app"          = "greenmile"
              - "env"          = "stg"
              - "microservice" = "auth"
              - "side"         = "backend"
            } -> null
          - session_affinity            = "ClientIP" -> null
          - type                        = "ClusterIP" -> null

          - port {
              - name        = "http" -> null
              - node_port   = 0 -> null
              - port        = 80 -> null
              - protocol    = "TCP" -> null
              - target_port = "http" -> null
            }
        }
    }

  # module.prod_apps.module.auth_microservice.kubernetes_deployment.microservice will be created
  + resource "kubernetes_deployment" "microservice" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"          = "greenmile"
              + "env"          = "prod"
              + "microservice" = "auth"
              + "side"         = "backend"
            }
          + name             = "auth-microservice"
          + namespace        = "greenmile-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "2"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app"          = "greenmile"
                  + "env"          = "prod"
                  + "microservice" = "auth"
                  + "side"         = "backend"
                }
            }

          + strategy {
              + type = (known after apply)

              + rolling_update {
                  + max_surge       = (known after apply)
                  + max_unavailable = (known after apply)
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app"          = "greenmile"
                      + "env"          = "prod"
                      + "microservice" = "auth"
                      + "side"         = "backend"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "ghcr.io/hackathon-climat-05/auth-microservice:v0.0.1"
                      + image_pull_policy          = "Always"
                      + name                       = "auth-microservice"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + liveness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 1
                          + period_seconds        = 1
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/livez"
                              + port   = "8080"
                              + scheme = "HTTP"
                            }
                        }

                      + port {
                          + container_port = 8080
                          + name           = "http"
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "1"
                              + "memory" = "512Mi"
                            }
                          + requests = {
                              + "cpu"    = "250m"
                              + "memory" = "50Mi"
                            }
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only        = (known after apply)
                          + secret_name      = (known after apply)
                          + secret_namespace = (known after apply)
                          + share_name       = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)

                          + node_publish_secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + divisor        = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # module.prod_apps.module.auth_microservice.kubernetes_horizontal_pod_autoscaler.autoscaler will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "autoscaler" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "auth-autoscaler"
          + namespace        = "greenmile-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 10
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = (known after apply)

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 50
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + kind = "Deployment"
              + name = "auth-microservice"
            }
        }
    }

  # module.prod_apps.module.auth_microservice.kubernetes_service.service will be created
  + resource "kubernetes_service" "service" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "auth"
          + namespace        = "greenmile-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + ip_families                 = (known after apply)
          + ip_family_policy            = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app"          = "greenmile"
              + "env"          = "prod"
              + "microservice" = "auth"
              + "side"         = "backend"
            }
          + session_affinity            = "ClientIP"
          + type                        = "ClusterIP"

          + port {
              + name        = "http"
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "http"
            }
        }
    }

  # module.prod_apps.module.calculator_microservice.kubernetes_deployment.microservice will be created
  + resource "kubernetes_deployment" "microservice" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"          = "greenmile"
              + "env"          = "prod"
              + "microservice" = "calculator"
              + "side"         = "backend"
            }
          + name             = "calculator-microservice"
          + namespace        = "greenmile-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "2"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app"          = "greenmile"
                  + "env"          = "prod"
                  + "microservice" = "calculator"
                  + "side"         = "backend"
                }
            }

          + strategy {
              + type = (known after apply)

              + rolling_update {
                  + max_surge       = (known after apply)
                  + max_unavailable = (known after apply)
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app"          = "greenmile"
                      + "env"          = "prod"
                      + "microservice" = "calculator"
                      + "side"         = "backend"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "ghcr.io/hackathon-climat-05/calculator-microservice:v0.0.1"
                      + image_pull_policy          = "Always"
                      + name                       = "calculator-microservice"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + liveness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 1
                          + period_seconds        = 1
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/livez"
                              + port   = "8080"
                              + scheme = "HTTP"
                            }
                        }

                      + port {
                          + container_port = 8080
                          + name           = "http"
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "1"
                              + "memory" = "512Mi"
                            }
                          + requests = {
                              + "cpu"    = "250m"
                              + "memory" = "50Mi"
                            }
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only        = (known after apply)
                          + secret_name      = (known after apply)
                          + secret_namespace = (known after apply)
                          + share_name       = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)

                          + node_publish_secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + divisor        = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # module.prod_apps.module.calculator_microservice.kubernetes_horizontal_pod_autoscaler.autoscaler will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "autoscaler" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "calculator-autoscaler"
          + namespace        = "greenmile-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 10
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = (known after apply)

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 50
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + kind = "Deployment"
              + name = "calculator-microservice"
            }
```

</details>

*Pushed by: @au2001, Action: `pull_request`*